---
title: RebarReinforcementData
classe: Autodesk.Revit.DB.Structure.RebarReinforcementData
namespace: Autodesk.Revit.DB.Structure
eredita: Autodesk.Revit.DB.Structure.ReinforcementData
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# RebarReinforcementData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 End { get; set; }` | `rebarReinforcementData.End` | Int32 |
| `ElementId RebarId { get; set; }` | `rebarReinforcementData.RebarId` | ElementId |
| `RebarReinforcementData Create(ElementId, Int32)` | `RebarReinforcementData.Create(rebarId, iEnd)` | RebarReinforcementData |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```